# 04 - Pandas - Processamento e Análise de Dados
## Aula 11 - 13 - Pandas - Aplicação de Funções em Dataframes e Séries (pipe, apply, transform, applymap e map)

## Professor: Orlando Oliveira dos Santos, MsC.
 - E-mail: professor.orlando.santos@gmail.com 
 - Youtube :https://www.youtube.com/channel/UCPWWbkPWFmOjXH50TQWNAYg
 - Linkedin: https://linkedin.com/in/orlandoosantos
 - Facebook: https://www.facebook.com/proforlandosantosmsc/
 - Twitter: https://twitter.com/ProfOrlandoMsC
 - Instagram: https://www.instagram.com/proforlandosantosmsc/

## Formação Acadêmica
- Mestrado em Computação Aplicada - UnB (2014 – 2016)	
- MBA, Administração Estratégica de Sistemas de Informação – FGV (2011 – 2013)
- Tecnólogo em Processamento de Dados, Análise e Desenvolvimento de Sistemas – FAETEC/SP (2000-2002)

#  Pandas - Aplicação de Funções em Dataframes e Séries (pipe, apply, transform, applymap e map)

# Função de Aplicação
Para aplicar as suas próprias funções ou as de outra biblioteca aos objetos pandas, exitem três formas:
- Aplicação de função tablewise :pipe()
- Aplicação de função em linha ou coluna :apply()
- API de agregação : agg() e transform()
- Aplicando funções Elementwise :applymap()

### Aplicação da função tablewise 
DataFrames e Seriespode ser passado para funções. 
No entanto, se a função precisar ser chamada de forma encadeada, considere o uso do método pipe().

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv('./content/totaisestadoscomregiao_arr.csv', sep=';',names =['REGIAO','UF','CASOS','OBITOS'])
df.head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

In [2]:
df['OBITOSMILHARES'] = df['OBITOS']/1000
df['CASOSMILHARES'] = df['CASOS']/1000
df['LETALIDADE'] = df['OBITOS']/ df['CASOS'] * 100
df.head()

         REGIAO  UF   CASOS  OBITOS  OBITOSMILHARES  CASOSMILHARES  LETALIDADE
0  Centro-Oeste  DF  221526    3845           3.845        221.526    1.735688
1  Centro-Oeste  GO  269857    6107           6.107        269.857    2.263050
2  Centro-Oeste  MS   89654    1699           1.699         89.654    1.895063
3  Centro-Oeste  MT  152968    4009           4.009        152.968    2.620810
4      Nordeste  AL   92951    2304           2.304         92.951    2.478725

In [3]:
def calculaobitosemmilhares(df):
    df['OBITOSMILHARES'] = df['OBITOS']/1000
    return df

def calculacasosemmilhares(df):
    df['CASOSMILHARES'] = df['CASOS']/1000
    return df

def calculaletalidades(df):
    df['LETALIDADE'] = df['OBITOS']/ df['CASOS'] * 100
    return df

In [4]:
df = df[['REGIAO','UF','CASOS','OBITOS']]
df.head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

In [5]:
calculaletalidades(calculaobitosemmilhares(calculacasosemmilhares(df))).head()

         REGIAO  UF   CASOS  OBITOS  CASOSMILHARES  OBITOSMILHARES  LETALIDADE
0  Centro-Oeste  DF  221526    3845        221.526           3.845    1.735688
1  Centro-Oeste  GO  269857    6107        269.857           6.107    2.263050
2  Centro-Oeste  MS   89654    1699         89.654           1.699    1.895063
3  Centro-Oeste  MT  152968    4009        152.968           4.009    2.620810
4      Nordeste  AL   92951    2304         92.951           2.304    2.478725

### É equivalente a:

In [6]:
df = pd.read_csv('./content/totaisestadoscomregiao_arr.csv', sep=';',names =['REGIAO','UF','CASOS','OBITOS'])
df.head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

In [7]:
(df.pipe(calculaobitosemmilhares)
    .pipe(calculacasosemmilhares)
    .pipe(calculaletalidades)
)
df.head()

         REGIAO  UF   CASOS  OBITOS  OBITOSMILHARES  CASOSMILHARES  LETALIDADE
0  Centro-Oeste  DF  221526    3845           3.845        221.526    1.735688
1  Centro-Oeste  GO  269857    6107           6.107        269.857    2.263050
2  Centro-Oeste  MS   89654    1699           1.699         89.654    1.895063
3  Centro-Oeste  MT  152968    4009           4.009        152.968    2.620810
4      Nordeste  AL   92951    2304           2.304         92.951    2.478725

### O Pandas recomenda o uso do pipe pois torna mais fácil usar suas próprias funções ou as funções de outra biblioteca encadeadas com os métodos do pandas.

In [8]:
(df.groupby('REGIAO')
    .pipe(lambda x: x.sum())
    .pipe(calculaobitosemmilhares)
    .pipe(calculacasosemmilhares)
    .pipe(lambda x: x.cumsum())
    .head()
)

                CASOS  OBITOS  OBITOSMILHARES  CASOSMILHARES  LETALIDADE
REGIAO
Centro-Oeste   734005   15660          15.660        734.005    8.514611
Nordeste      2287570   59206          59.206       2287.570   33.917467
Norte         3026901   75634          75.634       3026.901   47.394857
Sudeste       5105688  151922         151.922       5105.688   62.185199
Sul           5945849  167455         167.455       5945.849   67.854563

### Aplicação de função em linha ou coluna 

As funções arbitrárias podem ser aplicadas ao longo dos eixos de um DataFrame usando o método apply(), que, como os métodos de estatística descritiva, tem um axis argumento opcional

In [9]:
df = pd.read_csv('./content/totaisestadoscomregiao_arr.csv', sep=';'
                 ,names =['REGIAO','UF','CASOS','OBITOS'])
df.head()

         REGIAO  UF   CASOS  OBITOS
0  Centro-Oeste  DF  221526    3845
1  Centro-Oeste  GO  269857    6107
2  Centro-Oeste  MS   89654    1699
3  Centro-Oeste  MT  152968    4009
4      Nordeste  AL   92951    2304

In [10]:
df[['CASOS', 'OBITOS']].apply(np.mean)

CASOS     220216.629630
OBITOS      6202.037037
dtype: float64

In [11]:
dfT = df[['CASOS', 'OBITOS']].T
dfT

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
CASOS,221526,269857,89654,152968,92951,377445,288122,190321,140355,172716,...,76019,61001,78618,174144,387751,332396,1184496,246169,287204,306788
OBITOS,3845,6107,1699,4009,2304,8013,9461,4203,3223,8873,...,1511,709,1144,4058,9605,21698,40927,5793,6356,3384

In [12]:
dfT.apply(np.mean, axis=1)

CASOS     220216.629630
OBITOS      6202.037037
dtype: float64

In [13]:
df[['CASOS', 'OBITOS']].apply(lambda x: x.max() - x.min())

CASOS     1150771
OBITOS      40218
dtype: int64

In [14]:
df[['CASOS', 'OBITOS']].apply(np.cumsum).tail()

      CASOS  OBITOS
22  3921192  110995
23  5105688  151922
24  5351857  157715
25  5639061  164071
26  5945849  167455

In [15]:
df[['CASOS', 'OBITOS']].apply(np.log).tail()

        CASOS     OBITOS
22  12.714082   9.984975
23  13.984828  10.619545
24  12.413774   8.664406
25  12.567948   8.757155
26  12.633912   8.126814

O método apply() também pode ser passado um nome de método como texto

In [16]:
df[['CASOS', 'OBITOS']].apply('mean')

CASOS     220216.629630
OBITOS      6202.037037
dtype: float64

In [17]:
df[['CASOS', 'OBITOS']].T.apply('mean', axis=1)

CASOS     220216.629630
OBITOS      6202.037037
dtype: float64

In [18]:
df[['CASOS', 'OBITOS']].apply(lambda x: x.idxmax())

CASOS     23
OBITOS    23
dtype: int64

### Pode passar argumentos adicionais e argumentos de palavra-chave para o método apply() .

In [19]:
def valores_em_outra_unidade(x, divisor=1000):
    return (x / divisor)

In [20]:
df[['CASOS', 'OBITOS']].apply(valores_em_outra_unidade, divisor=100).head()

     CASOS  OBITOS
0  2215.26   38.45
1  2698.57   61.07
2   896.54   16.99
3  1529.68   40.09
4   929.51   23.04

# API Transform 
- O método transform() retorna um objeto indexado com o mesmo (mesmo tamanho) do original.
- Essa api é muito semelhante à API .agg.

In [21]:
import numpy as np
import pandas as pd
df = pd.read_csv('./content/totaisregioes_arr.csv', sep=';',names =['REGIAO','CASOS','OBITOS'])
df.head()

         REGIAO    CASOS  OBITOS
0  Centro-Oeste   734005   15660
1      Nordeste  1553565   43546
2         Norte   739331   16428
3       Sudeste  2078787   76288
4           Sul   840161   15533

In [22]:
df[3:5] = df[3:5].assign(CASOS = lambda x: x['CASOS'] * -1, OBITOS = lambda x: x['OBITOS'] * -1)
df.head()

         REGIAO    CASOS  OBITOS
0  Centro-Oeste   734005   15660
1      Nordeste  1553565   43546
2         Norte   739331   16428
3       Sudeste -2078787  -76288
4           Sul  -840161  -15533

### Transforme todo o quadro. 
.transform() permite funções de entrada como: uma função NumPy, um nome de função de string ou uma função definida pelo usuário.

In [23]:
df[['CASOS', 'OBITOS']].transform(np.abs)

     CASOS  OBITOS
0   734005   15660
1  1553565   43546
2   739331   16428
3  2078787   76288
4   840161   15533

In [24]:
df[['CASOS', 'OBITOS']].transform('abs')

     CASOS  OBITOS
0   734005   15660
1  1553565   43546
2   739331   16428
3  2078787   76288
4   840161   15533

In [25]:
df[['CASOS', 'OBITOS']].transform(lambda x: x.abs())

     CASOS  OBITOS
0   734005   15660
1  1553565   43546
2   739331   16428
3  2078787   76288
4   840161   15533

### Passar uma única função para .transform()  com um Series  resultará em uma única Series em retorno.

In [26]:
df['CASOS'].transform(np.square)

0     538763340025
1    2413564209225
2     546610327561
3    4321355391369
4     705870505921
Name: CASOS, dtype: int64

### Transforme com várias funções 
A passagem de várias funções produzirá uma coluna MultiIndexed DataFrame. O primeiro nível será os nomes das colunas do quadro original; o segundo nível serão os nomes das funções de transformação.

In [27]:
df.transform([np.abs, lambda x: x /1000, np.log])

     CASOS                        OBITOS
  absolute  <lambda>        log absolute <lambda>        log
0   734005   734.005  13.506271    15660   15.660   9.658865
1  1553565  1553.565  14.256063    43546   43.546  10.681573
2   739331   739.331  13.513501    16428   16.428   9.706742
3  2078787 -2078.787        NaN    76288  -76.288        NaN
4   840161  -840.161        NaN    15533  -15.533        NaN

Passar várias funções para uma série produzirá um DataFrame. Os nomes das colunas resultantes serão as funções de transformação.

In [28]:
df['CASOS'].transform([np.abs, lambda x: x /1000, np.log])

   absolute  <lambda>        log
0    734005   734.005  13.506271
1   1553565  1553.565  14.256063
2    739331   739.331  13.513501
3   2078787 -2078.787        NaN
4    840161  -840.161        NaN

### Transformando com um dicionario 
A passagem de um dicionário de funções permitirá a transformação seletiva por coluna.

In [29]:
df.transform({'CASOS': np.abs, 'OBITOS': lambda x: x /1000})

     CASOS  OBITOS
0   734005  15.660
1  1553565  43.546
2   739331  16.428
3  2078787 -76.288
4   840161 -15.533

Passar um dicionário de listas irá gerar um MultiIndexed DataFrame com essas transformações seletivas.

In [30]:
df.transform({'CASOS': np.abs, 'OBITOS': [lambda x: x /1000, np.log, np.log10]})

     CASOS   OBITOS
  absolute <lambda>        log     log10
0   734005   15.660   9.658865  4.194792
1  1553565   43.546  10.681573  4.638948
2   739331   16.428   9.706742  4.215585
3  2078787  -76.288        NaN       NaN
4   840161  -15.533        NaN       NaN

In [31]:
df2 = df.transform({'CASOS': np.abs, 'OBITOS': [lambda x: x /1000, np.log, np.log10]})
df2

     CASOS   OBITOS
  absolute <lambda>        log     log10
0   734005   15.660   9.658865  4.194792
1  1553565   43.546  10.681573  4.638948
2   739331   16.428   9.706742  4.215585
3  2078787  -76.288        NaN       NaN
4   840161  -15.533        NaN       NaN

In [32]:
df2.columns = ['CASOS','OBITOS em mil','OBITOS log','OBITOS log10']
df2

     CASOS  OBITOS em mil  OBITOS log  OBITOS log10
0   734005         15.660    9.658865      4.194792
1  1553565         43.546   10.681573      4.638948
2   739331         16.428    9.706742      4.215585
3  2078787        -76.288         NaN           NaN
4   840161        -15.533         NaN           NaN

## Aplicando funções elementwise 
Como nem todas as funções podem ser vetorizadas (aceitar matrizes NumPy e retornar outra matriz ou valor), os métodos applymap() em DataFrame aceitam qualquer função Python assumindo um único valor e retornando um único valor.

In [33]:
import numpy as np
import pandas as pd
df = pd.read_csv('./content/totaisregioes_arr.csv', sep=';',names =['REGIAO','CASOS','OBITOS'])
df.head()

         REGIAO    CASOS  OBITOS
0  Centro-Oeste   734005   15660
1      Nordeste  1553565   43546
2         Norte   739331   16428
3       Sudeste  2078787   76288
4           Sul   840161   15533

In [34]:
def extrai_sigla(x):
    return ''.join([w[0] for w in x.split('-') ]) + ('E' if 'deste' in x else '')

In [35]:
df['REGIAO'].map(extrai_sigla)

0    CO
1    NE
2     N
3    SE
4     S
Name: REGIAO, dtype: object

In [36]:
def unidade_milhares(x):
    valor = x
    
    if type(valor) is int:
        valor = round(valor/1000,2)
    return valor
        
unidade_milhares(121323)

121.32

In [37]:
def uppertext(x):
    return str(x).upper()

In [38]:
df

         REGIAO    CASOS  OBITOS
0  Centro-Oeste   734005   15660
1      Nordeste  1553565   43546
2         Norte   739331   16428
3       Sudeste  2078787   76288
4           Sul   840161   15533

In [39]:
df.applymap(uppertext)

         REGIAO    CASOS OBITOS
0  CENTRO-OESTE   734005  15660
1      NORDESTE  1553565  43546
2         NORTE   739331  16428
3       SUDESTE  2078787  76288
4           SUL   840161  15533

In [40]:
df.applymap(unidade_milhares)

         REGIAO    CASOS  OBITOS
0  Centro-Oeste   734.00   15.66
1      Nordeste  1553.57   43.55
2         Norte   739.33   16.43
3       Sudeste  2078.79   76.29
4           Sul   840.16   15.53

### Series.map() tem um recurso adicional; pode ser usado para “vincular” ou “mapear” facilmente valores definidos por uma série secundária.

In [41]:
regioes = pd.Series({'Centro-Oeste':'CO', 'Nordeste':'NE', 'Norte' : 'N', 'Sudeste': 'SE', 'Sul': 'S'})
regioes

Centro-Oeste    CO
Nordeste        NE
Norte            N
Sudeste         SE
Sul              S
dtype: object

In [42]:
df['SIGLA_REGIAO'] = df['REGIAO'].map(regioes)
df

         REGIAO    CASOS  OBITOS SIGLA_REGIAO
0  Centro-Oeste   734005   15660           CO
1      Nordeste  1553565   43546           NE
2         Norte   739331   16428            N
3       Sudeste  2078787   76288           SE
4           Sul   840161   15533            S